{"_type":"export","__export_format":4,"__export_date":"2021-11-23T21:20:35.951Z","__export_source":"insomnia.desktop.app:v2021.5.3","resources":[{"_id":"req_ea6e8f97ea2c41cab3fcc5f4b8b38d61","parentId":"fld_7cba656194504fa6b9c38a5c857f12da","modified":1637694560316,"created":1637692080639,"url":"{{ _.url }}/game/wish/5d9db5b2-c852-4fba-953e-486dc9bb1f17","name":"Wish game","description":"","method":"GET","body":{},"parameters":[],"headers":[{"id":"pair_649af7fd222d43d18452ead61bb56393","name":"Authorization","value":"Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImlzYWRmcm5AZ21haWwuY29tIiwiaWF0IjoxNjM3NjkxNzA2LCJleHAiOjE2Mzc2OTM1MDZ9.JeYGL-mN-TXN0I37-sTGOop3nnsU8quh9IPdm9WTkTE","description":""}],"authentication":{},"metaSortKey":-1637692080679,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"fld_7cba656194504fa6b9c38a5c857f12da","parentId":"wrk_bfb66b5390cc46a2a84df6e6352801ab","modified":1637685114967,"created":1637685114967,"name":"Auth","description":"","environment":{},"environmentPropertyOrder":null,"metaSortKey":-1637685114967,"_type":"request_group"},{"_id":"wrk_bfb66b5390cc46a2a84df6e6352801ab","parentId":null,"modified":1637613157816,"created":1637613157816,"name":"Nintendo Shop","description":"","scope":"collection","_type":"workspace"},{"_id":"req_81590351a0d540a4b432b0eaa7ae6e42","parentId":"fld_7cba656194504fa6b9c38a5c857f12da","modified":1637700914892,"created":1637692538593,"url":"{{ _.url }}/game/myWishList","name":"My Wish List","description":"","method":"GET","body":{},"parameters":[],"headers":[{"id":"pair_649af7fd222d43d18452ead61bb56393","name":"Authorization","value":"Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImlzYWJlbGxhZGVmcmVpdGFzbnVuZXNAZ21haWwuY29tIiwiaWF0IjoxNjM3NzAwODk3LCJleHAiOjE2Mzc3MDI2OTd9.tgUu7mRCf25UePlF_iaj1TOmkBj0XG28u2BKvfsk6wE","description":""}],"authentication":{},"metaSortKey":-1637691383629.5,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"req_b5da5945717645f9a26eaacf1978b078","parentId":"fld_7cba656194504fa6b9c38a5c857f12da","modified":1637694356361,"created":1637690686542,"url":"{{ _.url }}/auth/me","name":"Profile","description":"","method":"GET","body":{},"parameters":[],"headers":[{"id":"pair_84ad2bcc74904c1d9fd3189b20288a47","name":"Authorization","value":"Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6ImlzYWRmcm5AZ21haWwuY29tIiwiaWF0IjoxNjM3NjkxNzA2LCJleHAiOjE2Mzc2OTM1MDZ9.JeYGL-mN-TXN0I37-sTGOop3nnsU8quh9IPdm9WTkTE","description":""}],"authentication":{},"metaSortKey":-1637690686580,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"req_f60b6333b28943a0927ad1fdc01b7e0b","parentId":"fld_7cba656194504fa6b9c38a5c857f12da","modified":1637700894897,"created":1637685123502,"url":"{{ _.url }}/auth/login","name":"Login","description":"","method":"POST","body":{"mimeType":"application/json","text":"{\n\t\"email\": \"isabelladefreitasnunes@gmail.com\",\n\t\"password\": \"123456\"\n}"},"parameters":[],"headers":[{"name":"Content-Type","value":"application/json","id":"pair_4e78dee7b3814da4a865e03a9f728419"}],"authentication":{},"metaSortKey":-1637685123502,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"req_3d1e55fe0dfe41aa97cd62f70645fa3b","parentId":"fld_01a88a8e74694915941c271e79ea3df0","modified":1637695524916,"created":1637673223068,"url":"{{ _.url }}/game/createMany","name":"Create many games","description":"","method":"POST","body":{"mimeType":"application/json","text":"{\n\t\"games\": [\n\t\t{\n\t\t\t\"name\": \"Pokémon™ Brilliant Diamond and Pokémon™ Shining Pearl Double Pack\",\n\t\t\t\"year\": 2021,\n\t\t\t\"storyline\": \"Um pacote duplo contendo os jogos Pokémon Brilliant Diamond e Pokémon Shining Pearl também está disponível para compra na versão em formato físico ou em versão digital para download. A versão para download inclui ambas as cópias dos jogos Pokémon Brilliant Diamond e Pokémon Shining Pearl e ambos os jogos serão baixados automaticamente para o console vinculado à conta Nintendo que fez a compra. Se você comprar o pacote duplo na versão física ou digital, receberá um bônus de 200 Poké Balls™ por meio de códigos* de download que podem ser inseridos na funcionalidade Mystery Gift** do seu jogo! Um Manaphy Egg (ovo) será oferecido aos primeiros compradores do jogo Pokémon Brilliant Diamond ou do jogo Pokémon Shining Pearl. Você pode recebê-lo escolhendo “Get via internet” na funcionalidade Mystery Gift** em seu jogo, até segunda-feira, dia 21 de fevereiro de 2022 às 15h59 (horário do Pacífico). Em seguida, deixe o Manaphy com o Pokémon Nursery para obter um ovo contendo Phione!\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/en_US/games/switch/p/pokemon-brilliant-diamond-and-pokemon-shining-pearl-double-pack-switch/hero?v=2021112213\",\n\t\t\t\"price\": 598.00\n\t\t},\n\t\t{\n\t\t\t\"name\": \"Hextech Mayhem: A League of Legends Story™\",\n\t\t\t\"year\": 2021,\n\t\t\t\"storyline\": \"Neste jogo de ritmo frenético, toda ação gera uma reação explosiva, e aqui o caos é a palavra de ordem. Assuma o papel de Ziggs, o yordle especialista em Hexplosivos, e toque o terror nas redondezas de Piltover. Para dançar, isso aqui é bomba! Siga o ritmo da música e evite obstáculos, neutralize inimigos e acenda pavios para botar fogo no parquinho de uma vez por todas. Crie o caos e corra mais rápido do que o caretão do Heimerdinger para criar a maior bomba que o mundo já viu! Use o sistema de Caos Liberado para orquestrar explosões e ganhar pontos extras... e tudo isso enquanto dribla o esquadrão da chatice e mostra o que é se divertir em grande estilo. Brinque com pólvora em Hextech Mayhem: Uma História de League of Legends!\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/pt_BR/games/switch/h/hextech-mayhem-a-league-of-legends-story-switch/hero?v=2021112302\",\n\t\t\t\"price\": 41.50\n\t\t},\n\t\t{\n\t\t\t\"name\": \"Ruined King: A League of Legends Story™\",\n\t\t\t\"year\": 2021,\n\t\t\t\"storyline\": \"Reúna um grupo de Campeões de League of Legends, explore Águas de Sentina e viaje às Ilhas das Sombras para desvendar os segredos da temível Névoa Negra. Desenvolvido pela Airship Syndicate, criadora de Battle Chasers e Darksiders, com o estilo de arte do lendário quadrinista Joe Madureira, Ruined King: Uma História de League of Legends é o primeiro jogo da Riot Forge que convida você a explorar o universo de League of Legends. Neste envolvente RPG em turnos, você poderá personalizar seu grupo, controlar uma equipe inusitada de Campeões de League of Legends e explorar a exuberante cidade de Águas de Sentina e as misteriosas Ilhas das Sombras, além de experimentar o Sistema de Iniciativa de Rotas.\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/es_MX/games/switch/r/ruined-king-a-league-of-legends-story-switch/hero?v=2021111818\",\n\t\t\t\"price\": 129.99\n\t\t},\n    {\n\t\t\t\"name\": \"Pokémon™ Shining Pearl\",\n\t\t\t\"year\": 2021,\n\t\t\t\"storyline\": \"Vivencie a história nostálgica do jogo Pokémon™ Pearl Version em uma aventura reimaginada, Pokémon Shining Pearl, agora disponível no console Nintendo Switch™! As aventuras no jogo Pokémon Shining Pearl acontecerão na conhecida região de Sinnoh. Rica em natureza e com o poderoso Mount Coronet em seu núcleo, Sinnoh é uma terra de muitos mitos passados de geração em geração. Você poderá escolher Turtwig, Chimchar ou Piplup para ser seu primeiro parceiro Pokémon e, em seguida, partirá em sua jornada para se tornar o campeão da Pokémon League. Ao longo do caminho, você irá se deparar com a misteriosa organização Team Galactic e poderá encontrar o Pokémon Lendário Palkia.\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/pt_BR/games/switch/p/pokemon-shining-pearl-switch/hero?v=2021111918\",\n\t\t\t\"price\": 299.00\n\t\t},\n    {\n\t\t\t\"name\": \"Pokémon™ Brilliant Diamond\",\n\t\t\t\"year\": 2021,\n\t\t\t\"storyline\": \"Vivencie a história nostálgica do jogo Pokémon Diamond Version em uma aventura reimaginada, Pokémon Brilliant Diamond, agora disponível no console Nintendo Switch™! As aventuras no jogo Pokémon Brilliant Diamond acontecerão na conhecida região de Sinnoh. Rica em natureza e com o poderoso Mount Coronet em seu núcleo, Sinnoh é uma terra de muitos mitos passados de geração em geração. Você poderá escolher Turtwig, Chimchar ou Piplup para ser seu primeiro parceiro Pokémon e, em seguida, partirá em sua jornada para se tornar o campeão da Pokémon League. Ao longo do caminho, você irá se deparar com a misteriosa organização Team Galactic e poderá encontrar o Pokémon Lendário Dialga.\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/pt_BR/games/switch/p/pokemon-brilliant-diamond-switch/hero?v=2021112119\",\n\t\t\t\"price\": 299.00\n\t\t},\n    {\n\t\t\t\"name\": \"Mario Party™ Superstars\",\n\t\t\t\"year\": 2021,\n\t\t\t\"storyline\": \"Atenção, superestrelas! Mario Party™ está de volta com cinco tabuleiros clássicos dos jogos da série para Nintendo 64. Jogue para conseguir o máximo de estrelas (e sabotar seus adversários) em tabuleiros com o intergaláctico Espaçolândia ou o aterrorizante Medolâdia! A festa continua no seu próprio ritmo, já que você pode suspender uma partida e continuar depois do ponto em que parou! Em Mario Party, o jogo pode virar rapidamente, portanto, fiquem atentos, jogadores! Este e todos os outros modos também podem ser jogados online*!.\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/f_auto,q_auto,w_960,h_540/Play%20Nintendo/Mario%20Party%20Superstars/posters/Switch_MPS_LaunchTRL_5994_AvailableNow_YouTube_H264_UPDATED\",\n\t\t\t\"price\": 299.00\n\t\t},\n    {\n\t\t\t\"name\": \"Grand Theft Auto: The Trilogy – The Definitive Edition\",\n\t\t\t\"year\": 2021,\n\t\t\t\"storyline\": \"Três cidades icônicas, três histórias épicas. Jogue a clássica trilogia original de Grand Theft Auto que definiu o gênero – Grand Theft Auto III, Grand Theft Auto: Vice City e Grand Theft Auto: San Andreas – atualizada para a nova geração com diversos aprimoramentos, incluindo melhorias incríveis na iluminação e no ambiente, texturas de alta resolução, distâncias maiores de renderização, controles e mira no estilo de Grand Theft Auto V e muito mais, dando vida a esses mundos aclamados com um nível de detalhe inédito.\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/en_CA/games/switch/g/grand-theft-auto-the-trilogy-the-definitive-edition-switch/hero?v=2021111508\",\n\t\t\t\"price\": 299.00\n\t\t},\n    {\n\t\t\t\"name\": \"Metroid™ Dread\",\n\t\t\t\"year\": 2021,\n\t\t\t\"storyline\": \"Ao investigar uma transmissão misteriosa no planeta ZDR, Samus enfrenta um inimigo misterioso que a aprisiona neste mundo perigoso. O planeta remoto foi invadido por cruéis formas de vida alienígenas e robôs assassinos chamados E.M.M.I. Cace ou seja caçado enquanto abre caminho através de um labirinto de inimigos na aventura de deslocamento lateral mais intensa de Samus.\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/pt_BR/games/switch/m/metroid-dread-switch/hero?v=2021111913\",\n\t\t\t\"price\": 299.00\n\t\t},\n    {\n\t\t\t\"name\": \"Just Dance® 2022\",\n\t\t\t\"year\": 2021,\n\t\t\t\"storyline\": \"Just Dance® 2022, o jogo de dança definitivo, está de volta com ambientes inéditos e 40 novas faixas de sucessos, como Don't Go Yet da Camila Cabello, Love Story (Taylor's Version da Taylor Swift, Happier Than Ever da Billie Eilish e mais!\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/pt_BR/games/switch/j/just-dance-2022-switch/hero?v=2021112010\",\n\t\t\t\"price\": 239.95\n\t\t},\n    {\n\t\t\t\"name\": \"Mario Kart™ 8 Deluxe\",\n\t\t\t\"year\": 2017,\n\t\t\t\"storyline\": \"Acelere nesta versão definitiva do jogo Mario Kart 8 e jogue a qualquer hora, em qualquer lugar! Participe de corridas com seus amigos ou compita com eles em um modo de batalha revisado, em pistas de batalha que estão de volta, ou pistas completamente novas. Jogue com a comunicação local sem fio em multijogador para até quatro jogadores em 1080p ao jogar no modo TV. Todas as pistas da versão para o Wii U, incluindo conteúdo extra, estão de volta. Além disso, Inklings aparecem como novos personagens convidados, junto com favoritos que estão de volta, como Rei Bu, Quebra-ossos e Bowser Jr.!\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/pt_BR/games/switch/m/mario-kart-8-deluxe-switch/hero?v=2021111411\",\n\t\t\t\"price\": 299.00\n\t\t},\n    {\n\t\t\t\"name\": \"Super Smash Bros.™ Ultimate\",\n\t\t\t\"year\": 2018,\n\t\t\t\"storyline\": \"Personagens icônicos se enfrentam na luta definitiva, que você poderá jogar a qualquer hora, em qualquer lugar! Derrote seus rivais com os novos personagens Simon Belmont e King K. Rool, que juntam-se a Inkling, Ridley e todos os outros lutadores na história da série Super Smash Bros. Aproveite a velocidade e o combate melhorados e lute em novos cenários baseados na série Castlevania, Super Mario Odyssey e muito mais!\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/pt_BR/games/switch/s/super-smash-bros-ultimate-switch/hero?v=2021111809\",\n\t\t\t\"price\": 299.00\n\t\t},\n    {\n\t\t\t\"name\": \"Luigi’s Mansion™ 3\",\n\t\t\t\"year\": 2019,\n\t\t\t\"storyline\": \"Luigi foi convidado a se hospedar no suntuoso hotel Last Resort. Mas com o sumiço de Mario e seus amigos, nosso herói vestido de verde terá de superar seus medos para poder salvá-los! Golpeie, sopre e aspire os fantasmas com a novíssima Poltergust G-00, e junte suas forças com Gooigi para decifrar engenhocas e derrotar chefões endiabrados em cada piso temático deste hotel. E a aventura não para por aí: entre no ScareScraper para jogar no modo cooperativo com até 7 outros jogadores pela rede local sem fio ou online*!\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/pt_BR/games/switch/l/luigis-mansion-3-switch/hero?v=2021111800\",\n\t\t\t\"price\": 299.00\n\t\t},\n    {\n\t\t\t\"name\": \"Animal Crossing™: New Horizons\",\n\t\t\t\"year\": 2020,\n\t\t\t\"storyline\": \"Escape para uma ilha deserta e crie o seu próprio paraíso enquanto explora, cria e customiza em Animal Crossing: New Horizons. A sua ilha traz uma variedade incrível de recursos naturais que podem ser usados para criar de tudo, desde objetos para o seu conforto a ferramentas. Você pode caçar insetos ao amanhecer, decorar o seu paraíso durante o dia ou desfrutar do pôr do sol na praia enquanto pesca no oceano. A hora do dia e as estações do ano correspondem à realidade, então aproveite a oportunidade de conferir a sua ilha a cada dia para encontrar novas surpresas durante o ano todo.\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/pt_BR/games/switch/a/animal-crossing-new-horizons-switch/hero?v=2021112219\",\n\t\t\t\"price\": 299.00\n\t\t},\n    {\n\t\t\t\"name\": \"Stardew Valley\",\n\t\t\t\"year\": 2019,\n\t\t\t\"storyline\": \"Você herdou a antiga fazenda do seu avô em Stardew Valley. De posse de ferramentas usadas e de um punhado de moedas, você parte em direção à sua nova vida. Você conseguirá aprender a viver da terra e transformar o campo coberto de mato em um próspero lar? Não vai ser fácil. Desde que a Corporação Joja chegou à cidade, as antigas tradições quase desapareceram. O centro comunitário, que já fora o centro de atividade mais animado da cidade, agora está em ruínas. Mas parece que o vale está repleto de oportunidades. Com um pouco de dedicação, você poderá ser responsável por restaurar a grandeza de Stardew Valley!\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/pt_BR/games/switch/s/stardew-valley-switch/hero?v=2021111618\",\n\t\t\t\"price\": 24.99\n\t\t},\n    {\n\t\t\t\"name\": \"Super Mario™ 3D World + Bowser’s Fury\",\n\t\t\t\"year\": 2021,\n\t\t\t\"storyline\": \"Salte e escale por dezenas de fases coloridas! Multiplique a diversão juntando-se ou competindo contra amigos localmente* ou online** para alcançar o objetivo de cada fase. Trabalhem juntos para explorar e descobrir itens colecionáveis ou competir pela coroa ganhando a maior pontuação, criando um frenesi amistoso! Mario (e seus amigos) podem usar uma variedade de itens power-up como o Super Bell, que concede habilidades de gato, como escalar e arranhar. Aproveite as vantagens extras para completar as fases e conquistar a coroa!\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/pt_BR/games/switch/s/super-mario-3d-world-plus-bowsers-fury-switch/hero?v=2021111408\",\n\t\t\t\"price\": 299.00\n\t\t},\n    {\n\t\t\t\"name\": \"Mario Golf™: Super Rush\",\n\t\t\t\"year\": 2021,\n\t\t\t\"storyline\": \"Entre em campo com até quatro jogadores localmente* ou online** e jogue golfe com amigos da série Super Mario™ como Mario, Peach, Yoshi e muito mais! Os modos variam do Standard Golf ao enérgico Speed Golf e o emocionante Golf Adventure. Os controles simples de movimento ou controles de botões tornam mais fácil para novos jogadores e jogadores experientes darem tacadas.\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/pt_BR/games/switch/m/mario-golf-super-rush-switch/hero?v=2021111708\",\n\t\t\t\"price\": 299.00\n\t\t},\n    {\n\t\t\t\"name\": \"Kirby™ and the Forgotten Land\",\n\t\t\t\"year\": 2022,\n\t\t\t\"storyline\": \"Assuma o controle da ponderosa bolinha rosa, Kirby, e mova-se livremente por fases em 3D enquanto você descobre um mundo misterioso com estruturas abandonadas por uma civilização passada – como um shopping center?! Copie as habilidades dos inimigos, como Sword e Ice, e use-as para atacar e explorar os arredores! Que jornada espera por Kirby? Respire fundo e prepare-se para uma aventura inesquecível!\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/en_US/games/switch/k/kirby-and-the-forgotten-land-switch/hero?v=2021111815\",\n\t\t\t\"price\": 299.00\n\t\t},\n    {\n\t\t\t\"name\": \"Farming Simulator 22\",\n\t\t\t\"year\": 2022,\n\t\t\t\"storyline\": \"No papel de um fazendeiro moderno, use toda a sua criatividade para construir sua fazenda em três cenários diversos na América e na Europa. Farming Simulator 22 oferece uma enorme variedade de atividades agrícolas com foco em agricultura, pecuária e silvicultura, agora com a empolgante adição de ciclos sazonais!\",\n\t\t\t\"image\": \"https://cdn.cloudflare.steamstatic.com/steam/apps/1248130/header.jpg?t=1637668464\",\n\t\t\t\"price\": 159.00\n\t\t},\n    {\n\t\t\t\"name\": \"Horizon Zero Dawn™ Complete Edition\",\n\t\t\t\"year\": 2022,\n\t\t\t\"storyline\": \"Viva a experiência de Aloy em sua busca lendária para desvendar os mistérios de uma Terra do futuro controlada por máquinas. Use ataques táticos devastadores contra suas presas e explore um mundo aberto majestoso neste premiado RPG de aventura e ação!\",\n\t\t\t\"image\": \"https://cdn.cloudflare.steamstatic.com/steam/apps/1151640/header.jpg?t=1635442187\",\n\t\t\t\"price\": 100.00\n\t\t},\n    {\n\t\t\t\"name\": \"God of War\",\n\t\t\t\"year\": 2022,\n\t\t\t\"storyline\": \"Com a vingança contra os deuses do Olimpo em um passado distante, Kratos agora vive como um mortal no reino dos deuses e monstros nórdicos. É nesse mundo duro e implacável que ele deve lutar para sobreviver... e ensinar seu filho a fazer o mesmo.\",\n\t\t\t\"image\": \"https://cdn.cloudflare.steamstatic.com/steam/apps/1593500/header.jpg?t=1636735779\",\n\t\t\t\"price\": 199.90\n\t\t},\n    {\n\t\t\t\"name\": \"Poker Club\",\n\t\t\t\"year\": 2021,\n\t\t\t\"storyline\": \"Bem-vindo ao Poker Club. Vive a vida de um profissional de póquer na simulação mais realista de sempre! Junta-te a uma comunidade de jogadores online e sagra-te vencedor do circuito Poker Club Championship! Quer sejas um novato ou um experiente jogador de póquer, entra no mundo de Poker Club e eleva a fasquia!\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/pt_BR/games/switch/p/poker-club-switch/hero?v=2021111901\",\n\t\t\t\"price\": 128.52\n\t\t},\n    {\n\t\t\t\"name\": \"Sam & Max: Beyond Time and Space\",\n\t\t\t\"year\": 2021,\n\t\t\t\"storyline\": \"Sam & Max: Além do Tempo e Espaço é uma versão remasterizada da segunda temporada dos jogos episódicos de Sam & Max da Telltale, cuidadosamente atualizados por um pequeno grupo dos desenvolvedores originais. Sam é um cachorro detetive de um metro e oitenta e com faro para a justiça. Max é uma criatura-coelho hipercinética que adora confusão. Juntos, eles são a Freelance Police – uma dupla divertida e irreverente cujo estilo esotérico de combate ao crime vem divertindo fãs de quadrinhos e videogames por mais de trinta anos.\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/pt_BR/games/switch/s/sam-and-max-beyond-time-and-space-switch/hero?v=2021112121\",\n\t\t\t\"price\": 37.99\n\t\t},\n    {\n\t\t\t\"name\": \"Life is Strange Remastered Collection\",\n\t\t\t\"year\": 2021,\n\t\t\t\"storyline\": \"Volte a Arcadia Bay e vivencie dois jogos premiados como nunca antes! Os visuais e animações remasterizados dão vida nova ao excelente elenco de personagens e às histórias fascinantes.\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/E3/2021/Games/L_GHup7yonEunY/life-is-strange-remastered-collection-switch/hero?v=2021111618\",\n\t\t\t\"price\": 199.99\n\t\t},\n    {\n\t\t\t\"name\": \"Life is Strange: True Colors™\",\n\t\t\t\"year\": 2021,\n\t\t\t\"storyline\": \"Inicia uma nova e ousada era do premiado Life is Strange, com uma nova protagonista e um mistério emocionante a ser solucionado! Faz tempo que Alex Chen reprime a maldição que a assola: a habilidade sobrenatural de vivenciar, absorver e manipular as fortes emoções de outras pessoas, que aparecem para ela como auras coloridas e vibrantes. Após a morte de seu irmão em um suposto acidente, Alex precisa lidar com seu poder instável para descobrir a verdade e desvendar os segredos sombrios de uma pequena cidade.\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/E3/2021/Games/L_GHup7yonEunY/life-is-strange-true-colors-switch/hero?v=2021111820\",\n\t\t\t\"price\": 199.99\n\t\t},\n    {\n\t\t\t\"name\": \"MARIO + RABBIDS SPARKS OF HOPE\",\n\t\t\t\"year\": 2022,\n\t\t\t\"storyline\": \"Junte-se a Mario, Luigi, Princess Peach, Rabbid Peach, Rabbid Luigi e amigos numa aventura galáctica para derrotar uma entidade malvada e salvar seus companheiros Spark. Explore os planetas da galáxia enquanto descobre segredos misteriosos e missões imperdíveis!\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/E3/2021/Games/M_jhoLGI4TZf7W/mario-plus-rabbids-sparks-of-hope-switch/hero?v=2021112015\",\n\t\t\t\"price\": 299.99\n\t\t},\n    {\n\t\t\t\"name\": \"Metal Slug Tactics\",\n\t\t\t\"year\": 2022,\n\t\t\t\"storyline\": \"METAL SLUG está de volta com um novo capítulo do universo METAL SLUG. Descubra uma nova faceta desse icônico jogo de ação frenética e mergulhe em um RPG tático dinâmico com elementos roguelike! Divertido e descontraído, Metal Slug Tactics pega tudo o que o METAL SLUG tem de especial e único e transporta para o gênero tático!\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/en_US/games/switch/m/metal-slug-tactics-switch/hero?v=2021111304\",\n\t\t\t\"price\": 99.99\n\t\t},\n    {\n\t\t\t\"name\": \"Shadowrun: Dragonfall - Director's Cut\",\n\t\t\t\"year\": 2022,\n\t\t\t\"storyline\": \"Shadowrun: Dragonfall - Director’s Cut é o lançamento individual da aclamada campanha Dragonfall da Harebrained Schemes, lançada originalmente como uma expansão de Shadowrun Returns. A versão do diretor traz vários conteúdos novos e melhorias para o jogo original, criando a versão definitiva para consoles deste RPG cyberpunk único.\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/en_US/games/switch/s/shadowrun-dragonfall-directors-cut-switch/hero?v=2021111917\",\n\t\t\t\"price\": 199.99\n\t\t},\n    {\n\t\t\t\"name\": \"STAR WARS: Hunters™\",\n\t\t\t\"year\": 2022,\n\t\t\t\"storyline\": \"STAR WARS: Hunters™ conectará jogadores em tempo real via cross-play para travar batalhas em ambientes inspirados por lugares icônicos de STAR WARS. Os jogadores se juntarão a esquadrões de personagens inéditos e autênticos, como Caçadores de Recompensas, heróis da Rebelião e Stormtroopers Imperiais, neste jogo de ação imersivo e acelerado em uma galáxia deslumbrante do universo STAR WARS.\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/fr_CA/games/switch/s/star-wars-hunters-switch/hero?v=2021111602\",\n\t\t\t\"price\": 299.99\n\t\t},\n    {\n\t\t\t\"name\": \"Wreckfest\",\n\t\t\t\"year\": 2022,\n\t\t\t\"storyline\": \"Wreckfest possui uma paulada de opções de melhorias e personalizações. Você pode se preparar para a próxima corrida de demolição com para-choques reforçados, santantônios, protetores laterais e muito mais, ou pode preparar o carro para uma Corrida Lata Velha com peças de desempenho de motor como filtros de ar, árvores de cames, sistemas de combustível etc. Wreckfest está se tornando o melhor jogo de combate motorizado que existe.\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/en_US/games/switch/w/wreckfest-switch/hero?v=2021111412\",\n\t\t\t\"price\": 299.99\n\t\t},\n    {\n\t\t\t\"name\": \"LumbearJack\",\n\t\t\t\"year\": 2022,\n\t\t\t\"storyline\": \"Jack is a humble bear with a simple dream: to return nature to its former glory with the help of his trusty axe and his animal friends. Slice and dice through machinery, slap some sense into wasteful humans, and work with wacky woodland critters to thwart the sinister plans of up-and-coming industrial giant Evil Works.\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/en_US/games/switch/l/lumbearjack-switch/hero?v=2021111500\",\n\t\t\t\"price\": 299.99\n\t\t},\n    {\n\t\t\t\"name\": \"Shadowrun Trilogy\",\n\t\t\t\"year\": 2022,\n\t\t\t\"storyline\": \"Shadowrun Trilogy contém 3 jogos de RPG táticos clássicos passados numa distopia futurista cyberpunk onde a magia despertou, dando vida a criaturas fantásticas. Criado inicialmente como um RPG de mesa há 30 anos, essa ambientação única conquistou muitos fãs nas três últimas décadas.\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/en_US/games/switch/s/shadowrun-trilogy-switch/hero?v=2021111517\",\n\t\t\t\"price\": 299.99\n\t\t},\n    {\n\t\t\t\"name\": \"The Legend of Zelda™: Breath of the Wild\",\n\t\t\t\"year\": 2017,\n\t\t\t\"storyline\": \"Esqueça tudo que você sabe sobre os jogos da série The Legend of Zelda. Entre em um mundo de descobertas, exploração e aventura em The Legend of Zelda: Breath of the Wild, o novo jogo da famosa série que veio para romper barreiras. Viaje pelos vastos campos, florestas e montanhas enquanto descobre o que aconteceu com o reino de Hyrule nesta deslumbrante aventura a céu aberto. E agora no Nintendo Switch, a sua jornada tem mais liberdade do que nunca. Leve o seu console para qualquer lugar e viva aventuras na pele de Link da maneira que quiser.\",\n\t\t\t\"image\": \"https://assets.nintendo.com/image/upload/c_pad,f_auto,h_613,q_auto,w_1089/ncom/pt_BR/games/switch/t/the-legend-of-zelda-breath-of-the-wild-switch/hero?v=2021111321\",\n\t\t\t\"price\": 299.99\n\t\t},\n    {\n\t\t\t\"name\": \"Firewatch\",\n\t\t\t\"year\": 2016,\n\t\t\t\"storyline\": \"Firewatch is a single-player first-person mystery set in the Wyoming wilderness, where your only emotional lifeline is the person on the other end of a handheld radio.\",\n\t\t\t\"image\": \"https://cdn.cloudflare.steamstatic.com/steam/apps/383870/header.jpg?t=1602536561\",\n\t\t\t\"price\": 36.99\n\t\t},\n    {\n\t\t\t\"name\": \"FIFA 22\",\n\t\t\t\"year\": 2022,\n\t\t\t\"storyline\": \"Jogue o FIFA 22 e ganhe um Item de Jogador de Próxima Geração: receba um Item de Jogador de Próxima Geração (não negociável) no FIFA Ultimate Team a partir de 15 de dezembro ao jogar o FIFA 22 até 14 de janeiro de 2022*.\",\n\t\t\t\"image\": \"https://cdn.cloudflare.steamstatic.com/steam/apps/383870/header.jpg?t=1602536561\",\n\t\t\t\"price\": 36.99\n\t\t},\n    {\n\t\t\t\"name\": \"Terraria\",\n\t\t\t\"year\": 2011,\n\t\t\t\"storyline\": \"Dig, fight, explore, build! Nothing is impossible in this action-packed adventure game. Four Pack also available!\",\n\t\t\t\"image\": \"https://cdn.cloudflare.steamstatic.com/steam/apps/105600/header.jpg?t=1590092560\",\n\t\t\t\"price\": 9.99\n\t\t},\n    {\n\t\t\t\"name\": \"UNO\",\n\t\t\t\"year\": 2016,\n\t\t\t\"storyline\": \"UNO makes its return with new exciting features! Match cards by color or value and play action cards to change things up. Race against others to empty your hand before everyone else in Classic play or customize your experience with House Rules.\",\n\t\t\t\"image\": \"https://cdn.cloudflare.steamstatic.com/steam/apps/470220/header.jpg?t=1634326038\",\n\t\t\t\"price\": 1.99\n\t\t},\n    {\n\t\t\t\"name\": \"Battlefield™ 2042\",\n\t\t\t\"year\": 2022,\n\t\t\t\"storyline\": \"Battlefield™ 2042 é um jogo de tiro em primeira pessoa que marca o retorno à emblemática guerra total da franquia. Em um mundo num futuro próximo, transformado pela desordem, adapte-se a campos de batalha dinâmicos para superá-los com a ajuda do seu pelotão e de um arsenal de ponta.\",\n\t\t\t\"image\": \"https://cdn.cloudflare.steamstatic.com/steam/apps/1517290/header.jpg?t=1637392604\",\n\t\t\t\"price\": 249.00\n\t\t},\n    {\n\t\t\t\"name\": \"Cooking Simulator VR\",\n\t\t\t\"year\": 2021,\n\t\t\t\"storyline\": \"Torne-se o melhor chef! Assuma o controle de uma cozinha altamente polida e realista equipada com todo tipo de utensílios e balcões. Desbloqueie e domine mais de 80 receitas ou use dezenas de ingredientes naturais para cozinhar tudo o que quiser.\",\n\t\t\t\"image\": \"https://cdn.cloudflare.steamstatic.com/steam/apps/1358140/header.jpg?t=1636464660\",\n\t\t\t\"price\": 47.49\n\t\t},\n    {\n\t\t\t\"name\": \"Half-Life: Alyx\",\n\t\t\t\"year\": 2020,\n\t\t\t\"storyline\": \"Half-Life: Alyx é a volta da Valve à série Half-Life em realidade virtual. Trata-se da história de uma impossível luta contra uma raça alienígena cruel, conhecida como Combine, situada entre os eventos de Half-Life e Half-Life 2.\",\n\t\t\t\"image\": \"https://cdn.cloudflare.steamstatic.com/steam/apps/546560/header.jpg?t=1635876995\",\n\t\t\t\"price\": 109.99\n\t\t},\n    {\n\t\t\t\"name\": \"Half-Life: Alyx\",\n\t\t\t\"year\": 2020,\n\t\t\t\"storyline\": \"Half-Life: Alyx é a volta da Valve à série Half-Life em realidade virtual. Trata-se da história de uma impossível luta contra uma raça alienígena cruel, conhecida como Combine, situada entre os eventos de Half-Life e Half-Life 2.\",\n\t\t\t\"image\": \"https://cdn.cloudflare.steamstatic.com/steam/apps/546560/header.jpg?t=1635876995\",\n\t\t\t\"price\": 109.99\n\t\t},\n    {\n\t\t\t\"name\": \"Resident Evil 2\",\n\t\t\t\"year\": 2019,\n\t\t\t\"storyline\": \"Um vírus maligno toma conta dos residentes de Raccoon City em setembro de 1998, afundando a cidade no caos enquanto zumbis comedores de carne humana vagam pelas ruas em busca de sobreviventes.\",\n\t\t\t\"image\": \"https://cdn.cloudflare.steamstatic.com/steam/apps/883710/header.jpg?t=1635811811\",\n\t\t\t\"price\": 89.99\n\t\t},\n    {\n\t\t\t\"name\": \"Sniper Elite 4\",\n\t\t\t\"year\": 2017,\n\t\t\t\"storyline\": \"Descubra uma liberdade incomparável no maior e mais avançado jogo de tiro da Segunda Guerra já criado. Vivencie o combate tático em terceira pessoa, a diversidade na jogabilidade e os épicos disparos longos em níveis gigantescos enquanto você liberta a Itália do controle do Fascismo.\",\n\t\t\t\"image\": \"https://cdn.cloudflare.steamstatic.com/steam/apps/312660/header.jpg?t=1636393785\",\n\t\t\t\"price\": 105.99\n\t\t},\n    {\n\t\t\t\"name\": \"Age of Empires IV\",\n\t\t\t\"year\": 2021,\n\t\t\t\"storyline\": \"Um dos mais celebrados jogos de estratégia em tempo real está de volta com tudo em Age of Empires IV, colocando você no centro de grandes batalhas históricas que moldaram o mundo.\",\n\t\t\t\"image\": \"https://cdn.cloudflare.steamstatic.com/steam/apps/1466860/header.jpg?t=1636080484\",\n\t\t\t\"price\": 199.99\n\t\t},\n    {\n\t\t\t\"name\": \"Age of Mythology: Extended Edition\",\n\t\t\t\"year\": 2014,\n\t\t\t\"storyline\": \"Age of Mythology is back! Choose your god and take to the battlefield in this classic, upgraded with full Steamworks integration and enhanced features.\",\n\t\t\t\"image\": \"https://cdn.cloudflare.steamstatic.com/steam/apps/266840/header.jpg?t=1620145994\",\n\t\t\t\"price\": 55.99\n\t\t}\n\t]\n}"},"parameters":[],"headers":[{"name":"Content-Type","value":"application/json","id":"pair_04a3a91111e44784b7e410b71586c760"}],"authentication":{},"metaSortKey":-1637613326756,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"fld_01a88a8e74694915941c271e79ea3df0","parentId":"wrk_bfb66b5390cc46a2a84df6e6352801ab","modified":1637673146253,"created":1637673146253,"name":"Games","description":"","environment":{},"environmentPropertyOrder":null,"metaSortKey":-1637673146253,"_type":"request_group"},{"_id":"req_2e8ada0f71db4294acf52439e3a36a34","parentId":"fld_01a88a8e74694915941c271e79ea3df0","modified":1637694324880,"created":1637682790731,"url":"{{ _.url }}/game/findMany","name":"List all games","description":"","method":"GET","body":{"mimeType":"application/json","text":""},"parameters":[],"headers":[{"name":"Content-Type","value":"application/json","id":"pair_04a3a91111e44784b7e410b71586c760"}],"authentication":{},"metaSortKey":-1637613326706,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"req_1b6f6fed03c14675ab833da1be62515c","parentId":"fld_01a88a8e74694915941c271e79ea3df0","modified":1637694334740,"created":1637682891505,"url":"{{ _.url }}/game/find/5e1b51d9-fa44-4620-b8a3-7b045ba21057","name":"Find game","description":"","method":"GET","body":{"mimeType":"application/json","text":""},"parameters":[],"headers":[{"name":"Content-Type","value":"application/json","id":"pair_04a3a91111e44784b7e410b71586c760"}],"authentication":{},"metaSortKey":-1637613326656,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"req_1c539dc9ee8d4425a54bc495908d97b7","parentId":"fld_1775f3c8c8df47bb91af7e24382d6e98","modified":1637700870805,"created":1637613326856,"url":"{{ _.url }}/user/register","name":"Create user","description":"","method":"POST","body":{"mimeType":"application/json","text":"{\n\t\"name\": \"Isabella Nunes\",\n\t\"email\": \"isabelladefreitasnunes@gmail.com\",\n\t\"nickname\": \"isadfrn\",\n\t\"password\": \"12345\",\n\t\"passwordConfirmation\": \"12345\"\n}"},"parameters":[],"headers":[{"name":"Content-Type","value":"application/json","id":"pair_04a3a91111e44784b7e410b71586c760"}],"authentication":{},"metaSortKey":-1637613326856,"isPrivate":false,"settingStoreCookies":true,"settingSendCookies":true,"settingDisableRenderRequestBody":false,"settingEncodeUrl":true,"settingRebuildPath":true,"settingFollowRedirects":"global","_type":"request"},{"_id":"fld_1775f3c8c8df47bb91af7e24382d6e98","parentId":"wrk_bfb66b5390cc46a2a84df6e6352801ab","modified":1637613306636,"created":1637613306636,"name":"User","description":"","environment":{},"environmentPropertyOrder":null,"metaSortKey":-1637613306636,"_type":"request_group"},{"_id":"env_20c5497526151cbb95102e507b80751b72759796","parentId":"wrk_bfb66b5390cc46a2a84df6e6352801ab","modified":1637613157819,"created":1637613157819,"name":"Base Environment","data":{},"dataPropertyOrder":null,"color":null,"isPrivate":false,"metaSortKey":1637613157819,"_type":"environment"},{"_id":"jar_20c5497526151cbb95102e507b80751b72759796","parentId":"wrk_bfb66b5390cc46a2a84df6e6352801ab","modified":1637613157820,"created":1637613157820,"name":"Default Jar","cookies":[],"_type":"cookie_jar"},{"_id":"spc_69d1b4a7fce34627b922f7b4667c9da2","parentId":"wrk_bfb66b5390cc46a2a84df6e6352801ab","modified":1637613157817,"created":1637613157817,"fileName":"Nintendo Shop","contents":"","contentType":"yaml","_type":"api_spec"},{"_id":"env_868b811dd6104b10bb4d7b9bb7ba9129","parentId":"env_20c5497526151cbb95102e507b80751b72759796","modified":1637695678670,"created":1637613162088,"name":"Local","data":{"url":"localhost:3000"},"dataPropertyOrder":{"&":["url"]},"color":"#ff0000","isPrivate":false,"metaSortKey":1637613162088,"_type":"environment"},{"_id":"env_c77b214a7f10479aa165503a0350ca8c","parentId":"env_20c5497526151cbb95102e507b80751b72759796","modified":1637694288708,"created":1637613201766,"name":"Heroku","data":{"url":"https://nintendo-shop.herokuapp.com"},"dataPropertyOrder":{"&":["url"]},"color":"#5c46b4","isPrivate":false,"metaSortKey":1637613201766,"_type":"environment"}]}